Repository: marcoaoteixeira/WPF
Catalog: src/Nameless.WPF.Resources/Strings.*.resx
Languages: pt_br

# ComboBoxItem_Default_Select
source: Select
pt_br: Selecione

# ControlAppearance_Caution
source: Attention
pt_br: Atenção

# ControlAppearance_Danger
source: Error
pt_br: Erro

# ControlAppearance_Info
source: Information
pt_br: Informação

# ControlAppearance_Success
source: Success
pt_br: Sucesso

# DirectorySelectionBoxImpl_FallbackTitle
source: Select a directory...
pt_br: Selecionar um diretório...

# DirectorySelectionBoxImpl_FallbackTitle_Plural
source: Select directories...
pt_br: Selecionar diretórios...

# MessageBoxIcon_Attention
source: Attention
pt_br: Atenção

# MessageBoxIcon_Error
source: Error
pt_br: Erro

# MessageBoxIcon_Information
source: Information
pt_br: Informação

# MessageBoxIcon_Question
source: Question
pt_br: Questão

# MessageBoxIcon_Warning
source: Warning
pt_br: Aviso

# TaskRunnerWindow_Cancel_Button
source: Cancel
pt_br: Cancelar

# TaskRunnerWindow_Close_Button
source: Close
pt_br: Fechar

# TaskRunnerWindow_Default_Title
source: Task runner...
pt_br: Executor de tarefas...

# Theme_Light
source: Light
pt_br: Claro

# Theme_Dark
source: Dark
pt_br: Escuro

# Theme_HighContrast
source: High Contrast
pt_br: Alto Contraste

# GetLastestReleaseResponse_Failure_ReleaseSerialization
source: Couldn't retrieve latest release information.
pt_br: Não foi possível recuperar as informações da última release.

# GetLastestReleaseResponse_Failure_Exception
source: An error occurred while trying to retrieve latest release information: {0}
pt_br: Ocorreu um erro ao tentar retornar as informações de última release: {0}

# PerformDatabaseBackupNotification_Title
source: Database Backup
pt_br: Backup da Base de Dados

# PerformDatabaseBackupNotification_Success
source: Database backup successfully. The file can be found at: {0}
pt_br: Backup da base de dados concluído com sucesso. O arquivo pode ser encontrado em: {0}

# PerformDatabaseBackupNotification_ExecuteBackup_Starting
source: Starting database backup execution...
pt_br: Iniciando execução do backup da base de dados...

# PerformDatabaseBackupNotification_ExecuteBackup_Failure
source: An error occurred while executing database backup: {0}
pt_br: Ocorreu um erro durante a execução do backup da base de dados: {0}

# PerformDatabaseBackupNotification_ExecuteBackup_Finish
source: Database backup execution finished.
pt_br: Execução do backup da base de dados concluído.

# PerformDatabaseBackupNotification_PrepareBackupFile_Starting
source: Starting backup file preparation...
pt_br: Iniciando o preparo do arquivo de backup...

# PerformDatabaseBackupNotification_PrepareBackupFile_Failure
source: An error occurred while preparing the backup file: {0}
pt_br: Ocorre um erro durante a preparação do arquivo de backup: {0}

# PerformDatabaseBackupNotification_PrepareBackupFile_Finish
source: Backup file preparation execution finished successfully.
pt_br: Execução da preparação do arquivo de backup concluída com successo.

# PerformSystemUpdate_TaskRunnerWindow_Title
source: System Update
pt_br: Atualização do Sistema

# PerformDatabaseBackup_TaskRunnerWindow_Title
source: Database Backup
pt_br: Backup da Base de Dados

# AppConfigurationPageViewModel_ExecuteSystemUpdateAsync_MessageBox_Message
source: A new version is available for download. Do you want to download it to the application data directory?
pt_br: Uma nova versão está disponível para download. Deseja fazer download para a pasta de dados da aplicação?

# AppConfigurationPageViewModel_ExecuteSystemUpdateAsync_MessageBox_Title
source: New Version Available
pt_br: Nova Versão Disponível

# AppConfigurationPage_Title
source: Appearance & Behavior
pt_br: Aparência & Comportamento

# AppConfigurationPage_VersionCard_Title
source: Current Version
pt_br: Versão Atual

# AppConfigurationPage_VersionCard_PerformSystemUpdate_Button
source: Check System Update
pt_br: Verificar Atualização do Sistema

# AppConfigurationPage_DatabaseBackupCard_Title
source: Database Backup
pt_br: Backup da Base de Dados

# AppConfigurationPage_DatabaseBackupCard_Message
source: Create a copy of the Database to avoid possible data loss.
pt_br: Crie uma cópia da Base de Dados para evitar eventual perda de dados.

# AppConfigurationPage_DatabaseBackupCard_PerformDatabaseBackup_Button
source: Create Database Backup
pt_br: Criar Backup da Base de Dados

# AppConfigurationPage_ThemeCard_Title
source: Application Theme
pt_br: Tema da Aplicação

# AppConfigurationPage_ThemeCard_Message
source: Choose the application appearance
pt_br: Selecione a aparência da aplicação

# AppConfigurationPage_ExitBehaviorCard_Title
source: Confirm Before Exit
pt_br: Confirmação ao Sair

# AppConfigurationPage_ExitBehaviorCard_Message
source: Would you like the application ask you before leave?
pt_br: Deseja que a aplicação sempre pergunte antes de sair?

# AppConfigurationPage_AppDirectoryPathCard_Title
source: Application Data Directory
pt_br: Diretório de Dados da Aplicação

# AppConfigurationPage_AppDirectoryPathCard_Message
source: The directory that contains all application data, including configuration files, support files, and logs.
pt_br: O diretório que contêm todos os dados da aplicação, bem como arquivos de configuração, suporte e logs.

# AppConfigurationPage_AppDirectoryPathCard_Button
source: Open Application Data Directory
pt_br: Abrir Diretório da Aplicação

# AppConfigurationPage_ApplicationLogCard_Title
source: Application Log
pt_br: Log da Aplicação

# AppConfigurationPage_ApplicationLogCard_Message
source: Open the log file in the standard editor.
pt_br: Abrir o arquivo de log no editor padrão.

# AppConfigurationPage_ApplicationLogCard_Button
source: Open Application Log File
pt_br: Abrir Log da Aplicação

# MainWindow_CloseHandler_MessageBox_Title
source: Exit
pt_br: Sair

# MainWindow_CloseHandler_MessageBox_Message
source: Always ask before exit?
pt_br: Sempre perguntar antes de sair?
